In [1]:
import pandas as pd
import os
import random

os.getcwd()

'/home/nn/pattern-transformer'

In [3]:
dfs = []
for root,dirs,files in os.walk('./data'):
    for i in files:
        df = pd.read_csv(os.path.join(root, i))
        dfs.append(df)

In [8]:
print(len(dfs))

13559

In [12]:
dfs[5]

   [False]  [True]  [None]
0     3142    6264   594.0
1     3456    6544     NaN

In [19]:
# 先按数量是否相等来划分
sum_eqs = []
sum_neqs = []
for df in dfs[5:]:
    sum_row = df.sum(axis=1)
    if sum_row[0] != sum_row[1]:
        sum_neqs.append(df)
    else:
        sum_eqs.append(df)

In [26]:
print("两个query的结果数量相同的有:", len(sum_eqs))
print("两个query的结果数量不相同的有:", len(sum_neqs))

两个query的结果数量相同的有: 12648
两个query的结果数量不相同的有: 906

In [32]:
random.choice(sum_eqs)

   [False, False, 'TGOZy48', True]  [False, False, None, 'TGOZy48']
0                             37.0                              NaN
1                              NaN                             37.0

In [31]:
random.choice(sum_neqs)

   ['uZ', 'uZ']
0          3070
1          2816

In [40]:
def hasNa(dfs):
    sum_eqs_hasna = []
    sum_eqs_nona = []

    for df in dfs:
        if df.isna().any().any():
            sum_eqs_hasna.append(df)
        else:
            sum_eqs_nona.append(df)
    return sum_eqs_hasna, sum_eqs_nona

In [41]:
sum_eqs_hasna, sum_eqs_nona  = hasNa(sum_eqs)
sum_neqs_hasna, sum_neqs_nona  = hasNa(sum_neqs)

In [47]:
random.choice(sum_eqs_hasna)

,"['M1u', True]","['T', True]","[None, True]","[True, 's']","[False, 'M1u']","[False, 'T']","[False, None]","[False, 's']","['M1u', None]","[None, 'T']","[None, None]","[None, 's']"
0,1089,1089,1089,1089,1485,1387,1386,1386,NaN,NaN,NaN,NaN
1,1051,1026,1026,1026,1389,1350,1350,1350,108.0,108.0,108.0,108.0

In [43]:
random.choice(sum_eqs_nona)

,"[-961038438, False, 'U1tvHZkW', 'ni']","[-961038438, False, 'U1tvHZkW', 'x0r2I']","[-961038438, False, None, 'U1tvHZkW']","[-961038438, '7', False, 'U1tvHZkW']"
0,2016,2016,1984,1984
1,2000,2000,2000,2000

In [44]:
random.choice(sum_neqs_hasna)

   [False]
0    240.0
1      NaN

In [45]:
random.choice(sum_neqs_nona)

   ['6']
0      3
1      6